cask_args appdir: "~/Applications"

tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/cask"
tap "bramstein/webfonttools"
tap "caskroom/fonts"
# CLI tools
brew "ack"
brew "archey"
brew "autoconf"
brew "automake"
brew "bash"
brew "readline"
brew "bash-completion@2"
brew "coreutils"
brew "findutils"
brew "git"
brew "git-extras", link: false
brew "git-flow"
brew "git-lfs"
brew "git-standup"
brew "gnu-sed", args: ["with-default-names"]
brew "libksba"
brew "gnupg"
brew "gpg-agent"
brew "grep"
brew "htop"
brew "httrack"
brew "libtool"
brew "imagemagick", args: ["with-webp"]
brew "libyaml"
brew "node"
brew "openssh"
brew "openssl@1.1"
brew "pkg-config"
brew "screen"
brew "tor"
brew "unrar"
brew "vim", args: ["with-override-system-vi"]
brew "webkit2png"
brew "wget"
brew "youtube-dl"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "bramstein/webfonttools/woff2"
# Applications
cask "1password"
cask "android-file-transfer"
cask "android-platform-tools"
cask "androidtool"
cask "atom"
cask "beardedspice"
cask "betterzip"
cask "caffeine"
cask "caprine"
cask "cleanmymac"
cask "cyberduck"
cask "dash"
cask "dropbox"
cask "evernote"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "keybase"
cask "macdown"
cask "notion"
cask "nudgit"
cask "numi"
cask "osxfuse"
cask "soundcleod"
cask "soundcloud-downloader"
cask "spotify"
cask "textmate"
cask "the-unarchiver"
cask "transmission"
cask "tunnelbear"
cask "vlc"
cask "whatsapp"
cask "xscope"
# Fontes
cask "font-anonymouspro-nerd-font-mono"
cask "font-asap"
cask "font-awesome-terminal-fonts"
cask "font-blokk-neue"
cask "font-dosis"
cask "font-flamenco"
cask "font-fontawesome"
cask "font-hack"
cask "font-inconsolata-nerd-font-mono"
cask "font-input"
cask "font-iosevka-nerd-font-mono"
cask "font-lato"
cask "font-lekton-nerd-font-mono"
cask "font-monoid"
cask "font-nunito"
cask "font-open-sans"
cask "font-oxygen-mono"
cask "font-roboto"
cask "font-source-sans-pro"
cask "font-sourcecodepro-nerd-font"
cask "font-ubuntumono-nerd-font"
